ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151axx_cm4.h
/****************  Bit definition for RCC_PLL4FRACR register  *****************/
#define RCC_PLL4FRACR_FRACV_Pos                   (3U)
#define RCC_PLL4FRACR_FRACV_Msk                   (0x1FFFU << RCC_PLL4FRACR_FRACV_Pos)               /*!< 0x0000FFF8 */
#define RCC_PLL4FRACR_FRACV                       RCC_PLL4FRACR_FRACV_Msk                            /*!< Fractional part of the multiplication factor for PLL4 VCO */
#define RCC_PLL4FRACR_FRACV_0                     (0x1U << RCC_PLL4FRACR_FRACV_Pos)                  /*!< 0x00000008 */
#define RCC_PLL4FRACR_FRACV_1                     (0x2U << RCC_PLL4FRACR_FRACV_Pos)                 /*!< 0x00000010 */
#define RCC_PLL4FRACR_FRACV_2                     (0x4U << RCC_PLL4FRACR_FRACV_Pos)                 /*!< 0x00000020 */
#define RCC_PLL4FRACR_FRACV_3                     (0x8U << RCC_PLL4FRACR_FRACV_Pos)                 /*!< 0x00000040 */
#define RCC_PLL4FRACR_FRACV_4                     (0x10U << RCC_PLL4FRACR_FRACV_Pos)                 /*!< 0x00000080 */
#define RCC_PLL4FRACR_FRACV_5                     (0x20U << RCC_PLL4FRACR_FRACV_Pos)                /*!< 0x00000100 */
#define RCC_PLL4FRACR_FRACV_6                     (0x40U << RCC_PLL4FRACR_FRACV_Pos)                /*!< 0x00000200 */
#define RCC_PLL4FRACR_FRACV_7                     (0x80U << RCC_PLL4FRACR_FRACV_Pos)                /*!< 0x00000400 */
#define RCC_PLL4FRACR_FRACV_8                     (0x100U << RCC_PLL4FRACR_FRACV_Pos)                /*!< 0x00000800 */
#define RCC_PLL4FRACR_FRACV_9                     (0x200U << RCC_PLL4FRACR_FRACV_Pos)               /*!< 0x00001000 */
#define RCC_PLL4FRACR_FRACV_10                    (0x400U << RCC_PLL4FRACR_FRACV_Pos)               /*!< 0x00002000 */
#define RCC_PLL4FRACR_FRACV_11                    (0x800U << RCC_PLL4FRACR_FRACV_Pos)               /*!< 0x00004000 */
#define RCC_PLL4FRACR_FRACV_12                    (0x1000U << RCC_PLL4FRACR_FRACV_Pos)               /*!< 0x00008000 */
#define RCC_PLL4FRACR_FRACLE_Pos                  (16U)
#define RCC_PLL4FRACR_FRACLE_Msk                  (0x1U << RCC_PLL4FRACR_FRACLE_Pos)                 /*!< 0x00010000 */
#define RCC_PLL4FRACR_FRACLE                      RCC_PLL4FRACR_FRACLE_Msk                           /*!< PLL4 fractional latch enable */

/********************  Bit definition for RCC_PLL4CSGR register********************/
#define RCC_PLL4CSGR_MOD_PER_Pos              (0U)
#define RCC_PLL4CSGR_MOD_PER_Msk              (0x1FFFU << RCC_PLL4CSGR_MOD_PER_Pos) /*!< 0x00001FFF */
#define RCC_PLL4CSGR_MOD_PER                  RCC_PLL4CSGR_MOD_PER_Msk         /*Modulation Period Adjustment for PLL4*/
#define RCC_PLL4CSGR_TPDFN_DIS_Pos            (13U)
#define RCC_PLL4CSGR_TPDFN_DIS_Msk            (0x1U << RCC_PLL4CSGR_TPDFN_DIS_Pos) /*!< 0x00002000 */
#define RCC_PLL4CSGR_TPDFN_DIS                RCC_PLL4CSGR_TPDFN_DIS_Msk       /*Dithering TPDF noise control*/
#define RCC_PLL4CSGR_RPDFN_DIS_Pos            (14U)
#define RCC_PLL4CSGR_RPDFN_DIS_Msk            (0x1U << RCC_PLL4CSGR_RPDFN_DIS_Pos) /*!< 0x00004000 */
#define RCC_PLL4CSGR_RPDFN_DIS                RCC_PLL4CSGR_RPDFN_DIS_Msk       /*Dithering RPDF noise control*/
#define RCC_PLL4CSGR_SSCG_MODE_Pos            (15U)
#define RCC_PLL4CSGR_SSCG_MODE_Msk            (0x1U << RCC_PLL4CSGR_SSCG_MODE_Pos) /*!< 0x00008000 */
#define RCC_PLL4CSGR_SSCG_MODE                RCC_PLL4CSGR_SSCG_MODE_Msk       /*Spread spectrum clock generator mode*/
#define RCC_PLL4CSGR_INC_STEP_Pos             (16U)
#define RCC_PLL4CSGR_INC_STEP_Msk             (0x7FFFU << RCC_PLL4CSGR_INC_STEP_Pos) /*!< 0x7FFF0000 */
#define RCC_PLL4CSGR_INC_STEP                 RCC_PLL4CSGR_INC_STEP_Msk        /*Modulation Depth Adjustment for PLL4*/

/***************  Bit definition for RCC_I2C12CKSELR register  ****************/
#define RCC_I2C12CKSELR_I2C12SRC_Pos              (0U)
#define RCC_I2C12CKSELR_I2C12SRC_Msk              (0x7U << RCC_I2C12CKSELR_I2C12SRC_Pos)             /*!< 0x00000007 */
#define RCC_I2C12CKSELR_I2C12SRC                  RCC_I2C12CKSELR_I2C12SRC_Msk                       /*!< I2C1 and I2C2 kernel clock source selection */
#define RCC_I2C12CKSELR_I2C12SRC_0                (0x1U << RCC_I2C12CKSELR_I2C12SRC_Pos)             /*!< 0x00000001 */
#define RCC_I2C12CKSELR_I2C12SRC_1                (0x2U << RCC_I2C12CKSELR_I2C12SRC_Pos)             /*!< 0x00000002 */
#define RCC_I2C12CKSELR_I2C12SRC_2                (0x4U << RCC_I2C12CKSELR_I2C12SRC_Pos)             /*!< 0x00000004 */

/***************  Bit definition for RCC_I2C35CKSELR register  ****************/
#define RCC_I2C35CKSELR_I2C35SRC_Pos              (0U)
#define RCC_I2C35CKSELR_I2C35SRC_Msk              (0x7U << RCC_I2C35CKSELR_I2C35SRC_Pos)             /*!< 0x00000007 */
#define RCC_I2C35CKSELR_I2C35SRC                  RCC_I2C35CKSELR_I2C35SRC_Msk                       /*!< I2C3 and I2C5 kernel clock source selection */
#define RCC_I2C35CKSELR_I2C35SRC_0                (0x1U << RCC_I2C35CKSELR_I2C35SRC_Pos)             /*!< 0x00000001 */
#define RCC_I2C35CKSELR_I2C35SRC_1                (0x2U << RCC_I2C35CKSELR_I2C35SRC_Pos)             /*!< 0x00000002 */
#define RCC_I2C35CKSELR_I2C35SRC_2                (0x4U << RCC_I2C35CKSELR_I2C35SRC_Pos)             /*!< 0x00000004 */

/****************  Bit definition for RCC_SAI1CKSELR register  ****************/
#define RCC_SAI1CKSELR_SAI1SRC_Pos                (0U)
#define RCC_SAI1CKSELR_SAI1SRC_Msk                (0x7U << RCC_SAI1CKSELR_SAI1SRC_Pos)               /*!< 0x00000007 */
#define RCC_SAI1CKSELR_SAI1SRC                    RCC_SAI1CKSELR_SAI1SRC_Msk                         /*!< SAI1 and DFSDM kernel clock source selection */
#define RCC_SAI1CKSELR_SAI1SRC_0                  (0x1U << RCC_SAI1CKSELR_SAI1SRC_Pos)               /*!< 0x00000001 */
#define RCC_SAI1CKSELR_SAI1SRC_1                  (0x2U << RCC_SAI1CKSELR_SAI1SRC_Pos)               /*!< 0x00000002 */
#define RCC_SAI1CKSELR_SAI1SRC_2                  (0x4U << RCC_SAI1CKSELR_SAI1SRC_Pos)               /*!< 0x00000004 */

/****************  Bit definition for RCC_SAI2CKSELR register  ****************/
#define RCC_SAI2CKSELR_SAI2SRC_Pos                (0U)
#define RCC_SAI2CKSELR_SAI2SRC_Msk                (0x7U << RCC_SAI2CKSELR_SAI2SRC_Pos)               /*!< 0x00000007 */
#define RCC_SAI2CKSELR_SAI2SRC                    RCC_SAI2CKSELR_SAI2SRC_Msk                         /*!< SAI2 kernel clock source selection */
#define RCC_SAI2CKSELR_SAI2SRC_0                  (0x1U << RCC_SAI2CKSELR_SAI2SRC_Pos)               /*!< 0x00000001 */
#define RCC_SAI2CKSELR_SAI2SRC_1                  (0x2U << RCC_SAI2CKSELR_SAI2SRC_Pos)               /*!< 0x00000002 */
#define RCC_SAI2CKSELR_SAI2SRC_2                  (0x4U << RCC_SAI2CKSELR_SAI2SRC_Pos)               /*!< 0x00000004 */

/****************  Bit definition for RCC_SAI3CKSELR register  ****************/
#define RCC_SAI3CKSELR_SAI3SRC_Pos                (0U)
#define RCC_SAI3CKSELR_SAI3SRC_Msk                (0x7U << RCC_SAI3CKSELR_SAI3SRC_Pos)               /*!< 0x00000007 */
#define RCC_SAI3CKSELR_SAI3SRC                    RCC_SAI3CKSELR_SAI3SRC_Msk                         /*!< SAI3 kernel clock source selection */
#define RCC_SAI3CKSELR_SAI3SRC_0                  (0x1U << RCC_SAI3CKSELR_SAI3SRC_Pos)               /*!< 0x00000001 */
#define RCC_SAI3CKSELR_SAI3SRC_1                  (0x2U << RCC_SAI3CKSELR_SAI3SRC_Pos)               /*!< 0x00000002 */
#define RCC_SAI3CKSELR_SAI3SRC_2                  (0x4U << RCC_SAI3CKSELR_SAI3SRC_Pos)               /*!< 0x00000004 */

/****************  Bit definition for RCC_SAI4CKSELR register  ****************/
#define RCC_SAI4CKSELR_SAI4SRC_Pos                (0U)
#define RCC_SAI4CKSELR_SAI4SRC_Msk                (0x7U << RCC_SAI4CKSELR_SAI4SRC_Pos)               /*!< 0x00000007 */
#define RCC_SAI4CKSELR_SAI4SRC                    RCC_SAI4CKSELR_SAI4SRC_Msk                         /*!< SAI4 kernel clock source selection */
#define RCC_SAI4CKSELR_SAI4SRC_0                  (0x1U << RCC_SAI4CKSELR_SAI4SRC_Pos)               /*!< 0x00000001 */
#define RCC_SAI4CKSELR_SAI4SRC_1                  (0x2U << RCC_SAI4CKSELR_SAI4SRC_Pos)               /*!< 0x00000002 */
#define RCC_SAI4CKSELR_SAI4SRC_2                  (0x4U << RCC_SAI4CKSELR_SAI4SRC_Pos)               /*!< 0x00000004 */

/***************  Bit definition for RCC_SPI2S1CKSELR register  ***************/
#define RCC_SPI2S1CKSELR_SPI1SRC_Pos              (0U)
#define RCC_SPI2S1CKSELR_SPI1SRC_Msk              (0x7U << RCC_SPI2S1CKSELR_SPI1SRC_Pos)             /*!< 0x00000007 */
#define RCC_SPI2S1CKSELR_SPI1SRC                  RCC_SPI2S1CKSELR_SPI1SRC_Msk                       /*!< SPI/I2S1 kernel clock source selection */
#define RCC_SPI2S1CKSELR_SPI1SRC_0                (0x1U << RCC_SPI2S1CKSELR_SPI1SRC_Pos)             /*!< 0x00000001 */
#define RCC_SPI2S1CKSELR_SPI1SRC_1                (0x2U << RCC_SPI2S1CKSELR_SPI1SRC_Pos)             /*!< 0x00000002 */
#define RCC_SPI2S1CKSELR_SPI1SRC_2                (0x4U << RCC_SPI2S1CKSELR_SPI1SRC_Pos)             /*!< 0x00000004 */

/**************  Bit definition for RCC_SPI2S23CKSELR register  ***************/
#define RCC_SPI2S23CKSELR_SPI23SRC_Pos            (0U)
#define RCC_SPI2S23CKSELR_SPI23SRC_Msk            (0x7U << RCC_SPI2S23CKSELR_SPI23SRC_Pos)           /*!< 0x00000007 */
#define RCC_SPI2S23CKSELR_SPI23SRC                RCC_SPI2S23CKSELR_SPI23SRC_Msk                     /*!< SPI/I2S2,3 kernel clock source selection */
#define RCC_SPI2S23CKSELR_SPI23SRC_0              (0x1U << RCC_SPI2S23CKSELR_SPI23SRC_Pos)           /*!< 0x00000001 */
#define RCC_SPI2S23CKSELR_SPI23SRC_1              (0x2U << RCC_SPI2S23CKSELR_SPI23SRC_Pos)           /*!< 0x00000002 */
#define RCC_SPI2S23CKSELR_SPI23SRC_2              (0x4U << RCC_SPI2S23CKSELR_SPI23SRC_Pos)           /*!< 0x00000004 */

/***************  Bit definition for RCC_SPI45CKSELR register  ****************/
#define RCC_SPI45CKSELR_SPI45SRC_Pos              (0U)
#define RCC_SPI45CKSELR_SPI45SRC_Msk              (0x7U << RCC_SPI45CKSELR_SPI45SRC_Pos)             /*!< 0x00000007 */
#define RCC_SPI45CKSELR_SPI45SRC                  RCC_SPI45CKSELR_SPI45SRC_Msk                       /*!< SPI4,5 kernel clock source selection */
#define RCC_SPI45CKSELR_SPI45SRC_0                (0x1U << RCC_SPI45CKSELR_SPI45SRC_Pos)             /*!< 0x00000001 */
#define RCC_SPI45CKSELR_SPI45SRC_1                (0x2U << RCC_SPI45CKSELR_SPI45SRC_Pos)             /*!< 0x00000002 */
#define RCC_SPI45CKSELR_SPI45SRC_2                (0x4U << RCC_SPI45CKSELR_SPI45SRC_Pos)             /*!< 0x00000004 */

/***************  Bit definition for RCC_UART6CKSELR register  ****************/
#define RCC_UART6CKSELR_UART6SRC_Pos              (0U)
#define RCC_UART6CKSELR_UART6SRC_Msk              (0x7U << RCC_UART6CKSELR_UART6SRC_Pos)             /*!< 0x00000007 */
#define RCC_UART6CKSELR_UART6SRC                  RCC_UART6CKSELR_UART6SRC_Msk                       /*!< USART6 kernel clock source selection */
#define RCC_UART6CKSELR_UART6SRC_0                (0x1U << RCC_UART6CKSELR_UART6SRC_Pos)             /*!< 0x00000001 */
#define RCC_UART6CKSELR_UART6SRC_1                (0x2U << RCC_UART6CKSELR_UART6SRC_Pos)             /*!< 0x00000002 */
#define RCC_UART6CKSELR_UART6SRC_2                (0x4U << RCC_UART6CKSELR_UART6SRC_Pos)             /*!< 0x00000004 */

/***************  Bit definition for RCC_UART24CKSELR register  ***************/
#define RCC_UART24CKSELR_UART24SRC_Pos            (0U)
#define RCC_UART24CKSELR_UART24SRC_Msk            (0x7U << RCC_UART24CKSELR_UART24SRC_Pos)           /*!< 0x00000007 */
#define RCC_UART24CKSELR_UART24SRC                RCC_UART24CKSELR_UART24SRC_Msk                     /*!< USART2 and UART4 kernel clock source selection */
#define RCC_UART24CKSELR_UART24SRC_0              (0x1U << RCC_UART24CKSELR_UART24SRC_Pos)           /*!< 0x00000001 */
#define RCC_UART24CKSELR_UART24SRC_1              (0x2U << RCC_UART24CKSELR_UART24SRC_Pos)           /*!< 0x00000002 */
#define RCC_UART24CKSELR_UART24SRC_2              (0x4U << RCC_UART24CKSELR_UART24SRC_Pos)           /*!< 0x00000004 */

/***************  Bit definition for RCC_UART35CKSELR register  ***************/
#define RCC_UART35CKSELR_UART35SRC_Pos            (0U)
#define RCC_UART35CKSELR_UART35SRC_Msk            (0x7U << RCC_UART35CKSELR_UART35SRC_Pos)           /*!< 0x00000007 */
#define RCC_UART35CKSELR_UART35SRC                RCC_UART35CKSELR_UART35SRC_Msk                     /*!< USART3 and UART5 kernel clock source selection */
#define RCC_UART35CKSELR_UART35SRC_0              (0x1U << RCC_UART35CKSELR_UART35SRC_Pos)           /*!< 0x00000001 */
#define RCC_UART35CKSELR_UART35SRC_1              (0x2U << RCC_UART35CKSELR_UART35SRC_Pos)           /*!< 0x00000002 */
#define RCC_UART35CKSELR_UART35SRC_2              (0x4U << RCC_UART35CKSELR_UART35SRC_Pos)           /*!< 0x00000004 */

